[
  {
    "name": "milk",
    "reaction": "Sensitivity to cow’s milk varies from person to person, and reactions can be unpredictable. Symptoms of a milk allergy reaction can range from mild, such as hives, to severe, such as anaphylaxis.",
    "food_eg": [
      "butter",
      "buttermilk",
      "cheese",
      "mile",
      "milk powder",
      "whipped cream"
    ]
  },
  {
    "name": "peanut",
    "reaction":"Peanuts can cause a severe, potentially life-threatening allergic reaction (anaphylaxis). Allergic reactions can be unpredictable, and even very small amounts of peanut can cause one.",
    "food_eg": [
      "artificial nuts",
      "beer nuts",
      "chocolate",
      "grain breads",
      "Glazes",
      "peanut"
    ]
  },
  {
    "name": "fish",
    "reaction":"Finned fish can cause severe and potentially life-threatening allergic reactions (such as anaphylaxis). Allergic reactions can be unpredictable, and even very small amounts of fish can cause one.",
    "food_eg": [
      "fish",
      "worcestershire sauce",
      "caesar salad",
      "caesar dressing",
      "caponata",
      "fish sauce",
      "surimi",
      "caviar",
      "salmon"
    ]
  },
  {
    "name": "tree nuts",
    "reaction":"Tree nuts can cause a severe and potentially life-threatening allergic reaction (anaphylaxis). Allergic reactions can be unpredictable, and even very small amounts of tree nuts can cause one.",
    "food_eg": [
      "almonds",
      "brazil nuts",
      "cashews",
      "hazelnuts",
      "walnuts",
      "pecans",
      "nuts"
    ]
  },
  {
    "name": "shellfish",
    "reaction":"Shellfish can cause severe and potentially life-threatening allergic reactions (such as anaphylaxis). Allergic reactions can be unpredictable, and even very small amounts of shellfish can cause one.",
    "food_eg": [
      "barnacle",
      "crab",
      "crawfish",
      "krill",
      "lobster",
      "shrimp",
      "prawns"
    ]
  },
  {
    "name": "soy",
    "reaction":"Allergic reactions to soy are typically mild, but all reactions can be unpredictable. Although rare, severe and potentially life-threatening reactions can also occur.",
    "food_eg": [
      "tofu",
      "beer nuts",
      "soy",
      "meal replacements",
      "infant formula",
      "chili",
      "taco",
      "tamales"
    ]
  },
  {
    "name": "eggs",
    "reaction":"Symptoms of an egg allergy reaction can range from mild, such as hives, to severe, such as anaphylaxis. Allergic reactions can be unpredictable, and even very small amounts of egg can cause one.",
    "food_eg": ["egg"]
  },
  {
    "name": "gluten",
    "reaction":"Symptoms of a gluten allergy reaction can range from mild, such as hives, to severe, such as anaphylaxis. Allergic reactions can be unpredictable, and even very small amounts of wheat can cause one.",
    "food_eg": [
      "flour",
      "Wheat",
      "Wheat germ",
      "Rye",
      "Barley",
      "Bulgur",
      "rice"
    ]
  }
]
